<template>
<div align="center">
    <h2 class="mb-5">留学やワーホリ、その前に・・・ </h2>
    <p class="my-2">なぜ 私たち日本 人は、英語 が話せない のか？ ？ </p>
    <p class="my-2">それは、話さないからです。</p>
    <br>
    <p class="my-2">なぜ話さないのか？</p>
    <p class="my-2">英語を話さなくても困らないからです。</p>
    <br>
    <p class="my-2">そこであなたが、英語を話したいと願う時、</p>
    <p class="my-2">あなたに必要なものは、英語環境です。</p>
    <br>
    <p class="my-2">留学やワーキングホリデーで現地に行けばそこには、</p>
    <p class="my-2">英語環境があると思っていませんか？ </p>
    <br>
    <p class="my-2">留学やワーキングホリデーでの失敗談 NO.1 は、</p>
    <p class="my-2">現地でできた日本人の友達と仲良くなり</p>
    <p class="my-2">結局、英語環境から遠ざかってしまうことです。</p>
    <br>
    <p class="my-2">残ったのは、楽しい思い出と英語への苦手意識。</p>
    <p class="my-2">なんてことは、よくある話です。</p>
    <br>
    <p class="my-2">仮に、外国人との英語でのコミュニケーションを</p>
    <p class="my-2">日本にいるときから習慣化していたらどうでしょう？</p>
    <p class="my-2">もし日本にいるときから外国人の友達が居たとしたらどうでしょう？</p>
    <br>
    <p class="my-2">現地で日本人と大半の時間を過ごすでしょうか？</p>
    <p class="my-2">最高のスタートを切ることが最高の海外生活の入り口であることは、</p>
    <p class="my-2">間違いないでしょう。</p>
    <br>
    <p class="my-2">月額 500 円で、最高の海外生活を得られるとしたらあなたは、</p>
    <p class="my-2">その 500 円を浪費しますか？</p>
    <br>
    <p class="my-2">それとも未来のあなたへ投資しますか？</p>
    <br>
    <h3>「準備もしていないのに、目標を語る資格はない。」</h3>
    <v-container>
        <v-row justify="end">
            <V-col cols="4" md="5" xl="6">
                <h4>イチロー </h4>
            </V-col>
        </v-row>
    </v-container>
    
</div>
</template>