// 【規約】 モーダル

<template>
  <v-row justify="center">
    <v-dialog v-model="dialog" width="800px">
      <template v-slot:activator="{ on }">
        <!-- モーダルを開くボタン（このボタンを押すと下の<v-card></v-card>の内容が表示される） -->
        <v-btn text v-on="on">【利用規約】</v-btn>
      </template>
      <v-card>
        <v-card-title>
          <!-- モーダル上部のタイトル -->
          <span class="headline">利用規約</span>
        </v-card-title>
        <!-- モーダルのコンテンツ -->
        <v-card-text>
          <p>この利用規約は、「GG ONLINE」(以下、「本コミュニティ」という）が提供するFacebook上のグループを会員が利用する際の規約について定めたものになります。</p>

          <p class="mb-0">（適用範囲）</p>
          <ol>
            <li>この規約は、本コミュニティを利用されるすべての会員に適用されます。</li>
            <li>会員は、本コミュニティの会員登録をした時点で、本規約に同意したものとみなします。</li>
            <li>会員は、本規約を誠実に遵守してください。</li>
          </ol>
          <br>

          <p class="mb-0">（本コミュニティ）</p>
          <p>本コミュニティは、会員に対し、様々な言語の人種が交流するFacebook上の場所を提供します。</p>

          <p class="mb-0">（会員）</p>
          <p>会員とは、本規約を承諾の上、「入会申込書」に必要事項を記入し申込みをされたお客様で、本コミュニティが入会を許可したものを言います。</p>

          <p class="mb-0">（会員情報の変更）</p>
          <p>会員は、入会時の申込書に記載した情報に変更があった場合、速やかに本コミュニティ所定の電子書面にて、会員情報の変更を申請するものとします。</p>

          <p class="mb-0">（入会申込み後のクーリングオフ）</p>
          <ol>
            <li>申込者は、本契約書の交付の日を含め、電子書面によって申込みを撤回し解除することができます。</li>
            <li>契約の解除は申込者が申込みを撤回する旨を記載した電子書面を、コミュニティ宛に発信した時により成立します。</li>
            <li>申込みの撤回については、手数料を不要とし、申込者は損害賠償または違約金の支払いを請求されることはありません。</li>
            <li>退会申込みが発信されるまでの間に、更新された会費は、本コミュニティ側に支払わなければなりません。</li>
          </ol>
          <br>

          <p class="mb-0">（退会）</p>
          <p>会員は、退会を希望する場合、退会する月の末日まで（例：４月3日に退会される場合、4月31日まで）に本コミュニティに申請するものとします。なお、引き落としされた当月分の会費は、返金できません。</p>

          <p class="mb-0">（アクティビティ）</p>
          <p>“アクティビティ”とは、Facebook上の本コミュニティ内での活動の全てを指します。（例：ZoomやFacebookを利用した言語学習、物の交換や販売、イベントの開催など）</p>
          <ol>
            <li>会員は本コミュニティの各種アクティビティを規定の会費の支払いの上で参加することができます。</li>
            <li>アクティビティはいくつでも参加することができます。</li>
            <li>３．アクティビティの参加の条件などの権限は一時的に主催者に移譲します。</li>
          </ol>
          <br>

          <p class="mb-0">（会費）</p>
          <ol>
            <li>コミュニティの会費は自動引き落としによる支払いとなります。</li>
            <li>会費は毎月５００円（税抜）となります。</li>
            <li>３．口座振替の引き落とし日は、基本的に毎月26日締めで、前月13日から当月12日までの請求は当月26日請求となり、当月13日以降の請求は翌月26日請求となります。</li>
            <li>2020年9月12日までの間のコミュニティ利用料は無料とする。</li>
          </ol>
          <br>

          <p class="mb-0">（遵守事項）</p>
          <p>会員は、本コミュニティの利用について、次の事項を遵守してください。</p>
          <ol>
            <li>会員同士が敬意を持って接すること。</li>
            <li>自己の成長を促すこと。</li>
            <li>時間を守ること。</li>
            <li>失敗を誇ること。</li>
          </ol>
          <br>

          <p class="mb-0">（禁止行為）</p>
          <p>会員は以下の行為は行わないでください。</p>
          <ol>
            <li>会員の申込みにおいて虚偽の情報を提供すること。</li>
            <li>他の会員または主催者に迷惑にかかる行為をすること。</li>
            <li>他の会員と調和を乱すような行為をすること。</li>
            <li>本コミュニティ内のデータ環境に対し、不正にアクセスを行うこと。</li>
            <li>故意、過失を問わず、法律に違反する行為をすること。</li>
            <li>本コミュニティの運営に支障をきたす行為をすること。</li>
            <li>公序良俗に違反し、または他人に不利益を与える行為をすること。</li>
            <li>その他、本コミュニティが不適切と判断をすること。</li>
          </ol>
          <br>

          <p class="mb-0">（会員資格の取り消し）</p>
          <p>本コミュニティは、会員が以下のいずれかに該当した場合、会員の承諾なく本サービスの利用を停止し、会員資格を取り消すことが出来るものとします。</p>
          <ol>
            <li>本規約に違反した場合。</li>
            <li>本コミュニティに対する妨害行為があった場合。</li>
            <li>アクティビティ主催者または、他の会員からクレームが頻発したとき。</li>
            <li>本サービスを不正に利用した場合。</li>
            <li>その他、本コミュニティが不適切と判断した場合。</li>
          </ol>
          <br>

          <p class="mb-0">（損害賠償）</p>
          <p>会員が、本規約に違反した行為、またはその他不正もしくは違法な行為によって本コミュニティに損害を与えた場合、本コミュニティは会員に対して相応の損害賠償の請求を行うことが出来るものとします。</p>

          <p class="mb-0">（免責事項）</p>
          <p>本コミュニティは、本コミュニティの責に帰すべき事由を除いて、会員が当サービスを利用したこと、利用不能に関連起因する損害に対して賠償責任は負わないものとします。</p>
          
          <p>本コミュニティは、本コミュニティの責に帰すべき事由を除いて、会員がしたコミュニティ外での事故およびトラブル等に関してその責任を負わないものとします。</p>
          

        </v-card-text>
        <v-card-actions>
          <v-spacer></v-spacer>
          <v-btn color="green darken-1" text @click="dialog = false">同意しない</v-btn>
          <v-btn color="green darken-1" text @click="dialog = false">同意する</v-btn>
        </v-card-actions>
      </v-card>
    </v-dialog>
  </v-row>
</template>

<script>
    export default {
        data () {
            return {
                dialog: false,
            }
        },
    }
</script>